---
title: EnergyAnalysisMaterial
classe: Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial
namespace: Autodesk.Revit.DB.Analysis
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# EnergyAnalysisMaterial

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Density { get; }` | `energyAnalysisMaterial.Density` | Double |
| `String Description { get; }` | `energyAnalysisMaterial.Description` | String |
| `String MaterialName { get; }` | `energyAnalysisMaterial.MaterialName` | String |
| `Double SpecificHeatCapacity { get; }` | `energyAnalysisMaterial.SpecificHeatCapacity` | Double |
| `Double ThermalConductivity { get; }` | `energyAnalysisMaterial.ThermalConductivity` | Double |
| `Double ThermalResistance { get; }` | `energyAnalysisMaterial.ThermalResistance` | Double |
| `Double Thickness { get; }` | `energyAnalysisMaterial.Thickness` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```